WangXuhaoInSuda/Arduino_Core_CH32/variants/CH32V307EVT/PeripheralPins.cpp
  {PA_2,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)},
  {PD_5,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_USART2_ENABLE, 2, 0)}, // USART2_TX_1

  {PB_10, USART3, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)},
  {PC_10, USART3, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_FullRemap_USART3_ENABLE, 2, 0)}, // USART3_TX_1
  {PD_8,  USART3, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_PartialRemap_USART3_ENABLE, 2, 0)}, // USART3_TX_3
  {NC,    NP,    0}
};
#endif

#ifdef UART_MODULE_ENABLED
const PinMap PinMap_UART_RX[] = {
  {PC_11, UART4,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // UART4_RX
  {PB_1,  UART4,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART4_ENABLE, 2, 0)}, // UART4_RX_1
  {PE_1,  UART4,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART4_ENABLE, 2, 0)}
  {PD_2,  UART5,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // UART5_RX
  {PB_5,  UART5,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART5_ENABLE, 2, 0)}, // UART5_RX_1
  {PE_9,  UART5,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART5_ENABLE, 2, 0)}, // UART5_RX_2

  {PC_1,  UART6,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // UART6_RX
  {PB_9,  UART6,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART6_ENABLE, 2, 0)}, // UART6_RX_1
  {PE_11, UART6,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART6_ENABLE, 2, 0)}, // UART6_RX_2

  {PC_5,  UART7,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // UART7_RX
  {PA_15, UART7,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART7_ENABLE, 2, 0)}, // UART7_RX_1
  {PE_15, UART7,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART7_ENABLE, 2, 0)}, // UART7_RX_2
  
  {PC_3,  UART8,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // UART8_RX
  {PA_7,  UART8,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART8_ENABLE, 2, 0)}, // UART8_RX_1
  {PE_13, UART8,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART8_ENABLE, 2, 0)}, // UART8_RX_2

  {PA_10, USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // USART1_RX
  {PB_7,  USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART1_ENABLE, 2, 0)}, // USART1_RX_1
  {PA_8,  USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART1_HighBit_ENABLE, 2, 0)}, // USART1_RX_2
  {PA_7,  USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART1_Low_HighBit_ENABLE, 2, 0)}, // USART1_RX_3

  {PA_3,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // USART2_RX
  {PD_6,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART2_ENABLE, 2, 0)}, // USART2_RX_1

  {PB_11, USART3, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // USART3_RX
  {PC_11, USART3, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART3_ENABLE, 2, 0)}, // USART3_RX_1
  {PD_9,  USART3, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_PartialRemap_USART3_ENABLE, 2, 0)}, // USART3_RX_3
  {NC,    NP,    0}
};
#endif

#ifdef UART_MODULE_ENABLED
const PinMap PinMap_UART_RTS[] = {
  {PA_12, USART1, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // USART1_RTS
  {PA_12, USART1, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_USART1_ENABLE, 2, 0)}, // USART1_RTS_1
  {PA_9,  USART1, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_USART1_HighBit_ENABLE, 2, 0)}, // USART1_RTS_2
  {PC_5,  USART1, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_USART1_Low_HighBit_ENABLE, 2, 0)}, // USART1_RTS_3

  {PA_1,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // USART2_RTS
  {PD_4,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_USART2_ENABLE, 2, 0)}, // USART2_RTS_1
  
  {PB_14, USART3, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_FullRemap_USART3_ENABLE, 2, 0)}, // USART3_RTS
  {PB_14, USART3, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_FullRemap_USART3_ENABLE, 2, 0)}, // USART3_RTS_1
  {PD_12, USART3, CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_PartialRemap_USART3_ENABLE, 2, 0)}, // USART3_RTS_3

  {NC,    NP,    0}
};
#endif

#ifdef UART_MODULE_ENABLED
const PinMap PinMap_UART_CTS[] = {
  {PA_11, USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // USART1_CTS
  {PA_11, USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART1_ENABLE, 2, 0)}, // USART1_CTS_1
  {PA_5,  USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART1_HighBit_ENABLE, 2, 0)}, // USART1_CTS_2
  {PC_4,  USART1, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART1_Low_HighBit_ENABLE, 2, 0)}, // USART1_CTS_3

  {PA_0,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // USART2_CTS
  {PD_3,  USART2, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_USART2_ENABLE, 2, 0)}, // USART2_CTS_1

  {PB_13, USART3, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // USART3_CTS
  {PB_13, USART3, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_FullRemap_USART3_ENABLE, 2, 0)}, // USART3_CTS_1
  {PD_11, USART3, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_PartialRemap_USART3_ENABLE, 2, 0)}, // USART3_CTS_3
 
  {NC,    NP,    0}
};
#endif


#ifdef SPI_MODULE_ENABLED
const PinMap PinMap_SPI_MOSI[] = {
  {PA_7,  SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // SPI1_MOSI
  {PB_5,  SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_SPI1_ENABLE, 2, 0)}, // SPI1_MOSI

  {PB_15, SPI2,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // SPI2_MOSI

