WangXuhaoInSuda/Arduino_Core_CH32/variants/CH32V307EVT/PeripheralPins.cpp
  {PB_5,  SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // SPI3_MOSI
  {PC_12, SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_SPI3_ENABLE, 2, 0)}, // SPI3_MOSI
  // {PA_7,  SPI1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},
  // {PA_12, SPI1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},
  // {PC_3,  SPI2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI2)},
  {NC,    NP,    0}
};
#endif

#ifdef SPI_MODULE_ENABLED
const PinMap PinMap_SPI_MISO[] = {
  {PA_6,  SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // SPI1_MISO
  {PB_4,  SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_SPI1_ENABLE, 2, 0)}, // SPI1_MISO

  {PB_14, SPI2,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // SPI2_MISO

  {PB_4,  SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // SPI3_MISO
  {PC_11, SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_SPI3_ENABLE, 2, 0)}, // SPI3_MISO
  // {PA_6,  SPI1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},
  // {PA_11, SPI1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},
  // {PB_14,  SPI2, STM_PIN_DATA(STM_MODE_AF_PP,GPIO_PULLUP, GPIO_AF5_SPI2)},
  {NC,    NP,    0}
};
#endif

#ifdef SPI_MODULE_ENABLED
const PinMap PinMap_SPI_SCLK[] = {
  {PA_5,  SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // SPI1_SCK
  {PB_3,  SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_SPI1_ENABLE, 2, 0)}, // SPI1_SCK

  {PB_13, SPI2,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // SPI2_SCK

  {PB_3,  SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // SPI3_SCK
  {PC_10, SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_SPI3_ENABLE, 2, 0)}, // SPI3_SCK
  // {PA_1,  SPI1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},
  // {PA_5,  SPI1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},
  // {PB_13,  SPI2, STM_PIN_DATA(STM_MODE_AF_PP,GPIO_PULLUP, GPIO_AF5_SPI2)},
  {NC,    NP,    0}
};
#endif

#ifdef SPI_MODULE_ENABLED
const PinMap PinMap_SPI_SSEL[] = {
  {PA_4,  SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // SPI1_NSS
  {PA_15, SPI1,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_SPI1_ENABLE, 2, 0)}, // SPI1_NSS

  {PB_12, SPI2,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // SPI2_NSS

  {PA_15, SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // SPI3_NSS
  {PA_4,  SPI3,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_SPI3_ENABLE, 2, 0)}, // SPI3_NSS
  // {PA_4,  SPI1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},
  // {PB_12,  SPI2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},
  {NC,    NP,    0}
};
#endif

//*** CAN ***

#ifdef CAN_MODULE_ENABLED
const PinMap PinMap_CAN_RD[] = {
  {PA_11, CAN1,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // CAN1_RX
  {PD_0,  CAN1,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap1_CAN1_ENABLE, 2, 0)}, // CAN1_RX
  {PB_8,  CAN1,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap2_CAN1_ENABLE, 2, 0)}, // CAN1_RX

  {PB_12, CAN2,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_NONE, 2, 0)}, // CAN2_RX
  {PB_5,  CAN2,  CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_FLOAT, AFIO_Remap_CAN2_ENABLE, 2, 0)}, // CAN2_RX

 // {PA_11, CAN1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF9_CAN1)},
  {NC,    NP,    0}
};
#endif

#ifdef CAN_MODULE_ENABLED
const PinMap PinMap_CAN_TD[] = {
  {PA_12, CAN1,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // CAN1_TX
  {PD_1,  CAN1,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap1_CAN1_ENABLE, 2, 0)}, // CAN1_TX
  {PB_9,  CAN1,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap2_CAN1_ENABLE, 2, 0)}, // CAN1_TX

  {PB_13, CAN2,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_NONE, 2, 0)}, // CAN2_TX
  {PB_6,  CAN2,  CH_PIN_DATA_EXT(GPIO_MODE_OUTPUT_50Mhz, GPIO_CNF_OUTPUT_AF_PP, AFIO_Remap_CAN2_ENABLE)}, // CAN2_TX
 // {PA_12, CAN1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF9_CAN1)},
  {NC,    NP,    0}
};
#endif

//*** No ETHERNET ***

//*** QUADSPI ***

// #ifdef QSPI_MODULE_ENABLED
// const PinMap PinMap_QUADSPI[] = {
//   {PA_2,  QUADSPI, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_QUADSPI)}, // QUADSPI_BK1_NCS
//   {PB_10, QUADSPI, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_QUADSPI)}, // QUADSPI_CLK
//   {PB_0,  QUADSPI, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_QUADSPI)}, // QUADSPI_BK1_IO1
//   {PB_1,  QUADSPI, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_QUADSPI)}, // QUADSPI_BK1_IO0
//   {NC,    NP,    0}
// };
// #endif

//*** USB ***

#ifdef PCD_MODULE_ENABLED
const PinMap PinMap_USB[] = {
  {PA_11, USB1DM, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_ANALOG, AFIO_NONE, 2, 0)}, // USB1DM
  {PA_12, USB1DP, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_ANALOG, AFIO_NONE, 2, 0)}, // USB2DP
  {PB_6,  USB2DM, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_ANALOG, AFIO_NONE, 2, 0)}, // USBHD_DM
  {PB_7,  USB2DP, CH_PIN_DATA_EXT(GPIO_MODE_INPUT, GPIO_CNF_INPUT_ANALOG, AFIO_NONE, 2, 0)}, // USBHD_DP
  // {PA_11, USB, STM_PIN_DATA(STM_MODE_INPUT, GPIO_NOPULL, GPIO_AF10_USB_FS)}, // USB_DM
  // {PA_12, USB, STM_PIN_DATA(STM_MODE_INPUT, GPIO_NOPULL, GPIO_AF10_USB_FS)}, // USB_DP
  //  {PA_13, USB, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_USB_FS)}, // USB_NOE
  
  {NC,    NP,    0}
};
#endif

